import React, { useEffect } from 'react';

import {positionResultWindow} from "@/utils"

const Result: React.FC = () => {

  useEffect(() => {
    // positionResultWindow("result-window")
  
  }, []);


  return <div>智谱清言是由北京智谱华章科技有限公司开发的一款全面高效的AI聊天机器人。这款软件基于中英双语大模型ChatGLM开发，结合了万亿字符的文本与代码预训练以及有监督微调技术，具备丰富的功能。智谱清言app不仅支持通用问答，还能进行角色扮演、创意写作和代码生成等多种操作，旨在帮助用户更智慧地工作和生活。
  智谱清言的功能覆盖了多个领域，包括但不限于：
  通用问答：能够回答各类问题，涵盖众多领域。
  媒体写作：包括文章创作、新闻选题、微博宣发、产品PR、APP种草、短报编写、公众号推文等。
  写作：包括创意写作文、标题生成、广告文案、PPT大纲、开题报告、分镜脚本等。
  学习：如雅思作文、学习计划、研报大纲、语法修改、论文框架、古风诗词、专业计划等。
  职场：涉及简历框架、工作规划、新闻稿、简历润色、工作总结、面试准备等。
  编程：包括测试用例、ASCI II艺术家、小游戏、H5动画、Linux命令、SQL查询等。
  教育：成语故事、成语接龙、睡前故事、历史解读、朝代故事等。
  此外，智谱清言还提供了AI绘画、AI搜索引擎、AI文档阅读和AI问答等多种功能。
  智谱清言app的当前版本为v2.6.8，文件大小约为58.0M，支持中文语言，并且是一款免费软件。</div>;
}

export default Result;
